<?php
/**
 * @package Persian_Quotes
 * @version 1.0.1
 */
/*
Plugin Name: Persian Quotes <br> گفتاورد پـارســـی
Plugin URI: http://mirani.ir/blog/persian-quotes/
Description: این فقط یک افزونه نیست! این مجموعه ای از گفته های ارزشمند بزرگان ایران زمین است. وقتی این افزونه را فعال کردید، یک گفته از بزرگان ایران زمین را به صورت تصادفی در بالا و سمت چپ تمامی صفحات بخش مدیریت خود خواهید دید. و به اینکه ایرانی هستید و فرزند سرزمین پارس، سرزمین کوروش بزرگ، خواهید بالید! (این نسخه مجموعه ای منتخب از سخنان مولا علی (ع) به مناسبت شب های قدر و شهادت آنحضرت می باشد. امام علی (ع) از سرزمین پارس نیست! اما عشق او در قلب های مردمان این سرزمین ریشه دوانده است) سخنان این مجموعه، متناسب با رویدادها و شخصیت های ایرانی به روز خواهد شد.
Author: mEhdi mirani
Version: 1.0.1
Author URI: http://mehdi.mirani.ir/
*/

function persian_quotes_get_lyric() {
	/** These are the lyrics to Persian Quotes */
	$lyrics = "دیده از خار و خاشاک روزگار بپوش وگرنه هیچ گاه خرسند نخواهی بود. «امام علی (ع) - غررالحکم»
به هرکه خواهی نیکی کن و بزرگ او باش. «امام علی (ع) - غررالحکم»
بخشش خداوند به اندازهٔ نیت آدمی است. «امام علی (ع) - غررالحکم»
روزی تو جویای تو است؛ سخت تر از آن که تو در طلب آنی. پس در خواستن آن آرام باش. «امام علی (ع) - غررالحکم»
میانه روی، کم را بسیار گرداند. «امام علی (ع) - غررالحکم»
نزدیکی آدمی به خداوند سبحان به پاکی اندیشه اوست. «امام علی (ع) - غررالحکم»
با خداوند به شوق آنچه نزد اوست، دوستی کن. «امام علی (ع) - غررالحکم»
رازت را به کسی نگو. چیزی را که خودت نمی‌توانی حفظ کنی چطور انتظار داری دیگران آنرا برایت حفظ کنند. «امام علی (ع) - نهج البلاغه»
حماقت دردی است که درمان ندارد. «امام علی (ع) - نهج البلاغه»
بگذارید و بگذرید، ببینید ولی دل نبندید که دیر یا زود باید گذاشت و گذشت. «امام علی (ع) - نهج البلاغه»
هنگامی که بر دشمنت پیروز شدی عفو را شکرانه این پیروزی قرارده. «امام علی (ع) - نهج البلاغه»
هر شخص گرفتاری را نمی‏توان سرزنش کرد(چه بسا بی‏تقصیر باشد!) «امام علی (ع) - نهج البلاغه»
کسی که کردارش او را به جایی نرساند، افتخارات خاندانش او را به جایی نخواهد رسانید. «امام علی (ع) - نهج البلاغه»
ای فرزند آدم هنگامی که ببینی پروردگارت پی‏درپی نعمتهایش رابر تو می‏فرستد در حالیکه تو معصیت او را می‌کنی بترس (که مجازات سنگینی درانتظار تو است!) «امام علی (ع) - نهج البلاغه»
برترین زهد مخفی داشتن زهد است. «امام علی (ع) - نهج البلاغه»
بخشنده باش اما زیاده‌روی نکن، در زندگی حسابگر باش اما سخت‌گیر مباش. «امام علی (ع) - نهج البلاغه»
از دوستی با احمق بپرهیز، چرا که می‌خواهد به تو نفعی رساند اما دچار زیانت می‌کند. «امام علی (ع) - نهج البلاغه»
از دوستی با بخیل بپرهیز، زیرا آنچه را که سخت به آن نیاز داری از تو دریغ می‌دارد. «امام علی (ع) - نهج البلاغه»
از دوستی با بدکار بپرهیز، که با اندک بهایی تو را می‌فروشد. «امام علی (ع) - نهج البلاغه»
از دوستی با دروغگو بپرهیز که به سراب ماند: دور را به تو نزدیک و نزدیک را دور می‌نمایاند. «امام علی (ع) - نهج البلاغه»
زبان عاقل در پشت قلب اوست، و قلب احمق در پشت زبانش قرار دارد.(شکل دیگر: قلب احمق در دهان او و زبان عاقل در قلب او قرار دارد.) «امام علی (ع) - نهج البلاغه»
به خدا سوگند که دنیای شما در نزد من پست‌تر و حقیرتر است از استخوان خوکی در دست جذامی! «امام علی (ع) - نهج البلاغه»
چه بسیار کسانی که در آغاز روز بودند و به شامگاه نرسیدند. و چه بسیار کسانی که در آغاز شب بر او حسد می بردند و در پایان شب به سوگشان نشستند! «امام علی (ع) - نهج البلاغه»
ناتوان ترین مردم کسی است که در دوست یابی ناتوان است، و از او ناتوان‌تر آن که دوستان خود را از دست بدهد. «امام علی (ع)»
کسی را که شکیبایی نجات ندهد، بی تابی او را هلاک گرداند. «امام علی (ع)»
مالی که نابودی آن تو را پند می‌دهد، از دست نرفته‌است. «امام علی (ع)»
دو نعمت است که ارزش آنها را نمی‌دانند مگر کسی که آنها را از دست داده باشد: جوانی و تندرستی. «امام علی (ع)»
شتاب کردن در کاری پیش از بدست آوردن توانایی و سستی کردن بعد از به دست آوردن فرصت از نادانی است. «امام علی (ع)»
اگر آرزومندید که به سعادت برسید، پیش از آنکه خود عبرت دیگران شوید، از دیگران پند و عبرت گیرید. «امام علی (ع)»
در شگفتم از بخیل: به سوی فقری می‌شتابد که از آن می‌گریزد،و سرمایه‌ای را از دست می‌دهد که برای آن تلاش می‌کند.در دنیا چون تهیدستان زندگی می‌کند،اما در آخرت چون سرمایه داران محاکمه می‌شود! «امام علی (ع)»
در شگفتم از متکبری که دیروز نطفه‌ای بی ارزش، و فردا مرداری گندیده خواهد بود! «امام علی (ع)»
در شگفتم از آن کس که آفرینش پدیده‌ها را می‌نگرد و در وجود خدا تردید دارد! «امام علی (ع)»
در شگفتم از آن کس که مردگان را می‌بیند و مرگ را از یاد برده‌است! «امام علی (ع)»
در شگفتم از آن کس که پیدایش دوباره را انکار می‌کند در حالی که پیدایش آغازین را می‌نگرد! «امام علی (ع)»
در شگفتم از آن کس که خانه نابودشدنی را آباد می‌کند اما جایگاه همیشگی را از یاد برده‌است! «امام علی (ع)»
پیش از آنکه عزم کاری کنی مشورت کن و پیش از آنکه قدم در کاری بنهی، بیاندیش! «امام علی (ع)»
زبان، حیوان درنده‌است، اگر رها شود می‌گزد. «امام علی (ع)»
قیمت و ارزش هر کس به اندازهٔ کاری است که به خوبی می‌تواند انجام دهد. «امام علی (ع)»
قربانگاه عقل‌ها غالبا در پرتو طمع‌ها است. «امام علی (ع)»
بزرگترین عیب آن است که آنچه را که مانند آن در خود توست عیب بشماری. «امام علی (ع)»
بزرگی پروردگار در جانت، پدیده‌ها را در چشمت کوچک می‌نمایاند. «امام علی (ع)»
آبروی تو چون یخی جامد است که در خواست آن را قطره قطره آب می‌کند، پس بنگر که آن را نزد چه کسی فرو می‌ریزی. «امام علی (ع)»
ممکن است در زندگی بی‌جهت، بسیار مورد سرزنش قراربگیری، ولی هرگز بی‌جهت سرزنش مکن. «امام علی (ع)»
اندیشیدن همانند دیدن نیست، زیرا گاهی چشم‌ها دروغ می‌نمایاند, اما آن کس که از عقل نصیحت خواهد به او خیانت نمی‌کند. «امام علی (ع)»
کسی که از گفتن «نمی دانم» روی گردان است، به هلاکت و نابودی می‌رسد! «امام علی (ع)»
دنیای حرام چون مار سمی است، پوست آن نرم ولی سم کشنده در درون دارد، نادان فریب خورده به آن می‌گراید و هوشمند عاقل از آن دوری گزیند. «امام علی (ع)»
چقدر فاصله بین دو عمل دور است: عملی که لذتش می‌رود و کیفر آن می‌ماند و عملی که رنج آن می‌گذرد و پاداش آن ماندگار است! «امام علی (ع)»
همانا خدای سبحان روزی فقرا را در اموال سرمایه‌داران قرار داده‌است، پس فقیری گرسنه نمی‌ماند جز به کامیابی توانگران، و خداوند از آنان درباره گرسنگی گرسنگان خواهد پرسید. «امام علی (ع)»
تا زمانی که سخن نگفته‌ای کلامت بندهٔ توست اما وقتی سخن گفتی تو بندهٔ سخنت هستی. «امام علی (ع)»
جهان هرکس به اندازهٔ وسعت فکر اوست! «امام علی (ع)»
آنچه کهنه‌اش بهتر است، دوست است. «امام علی (ع)»
اگر کسی حقیقتی را نداند، نادان است،اما اگر کسی بداند و دانایی خود را انکار کند جنایتکار است! «امام علی (ع)»
بهای وجود شما بهشت است پس آن را جز به بهشت نفروشید. «امام علی (ع)»
هر که به من یک کلمه بیاموزد مرا بنده خویش کرده‌است! «امام علی (ع)»
قلبهای خود را از کینه‌های نهانی پاک کنید چه آن یک بیماری مهلکی همانند وبا است! «امام علی (ع)»
با ارزش ترین بی نیازی ترک آرزو است. «امام علی (ع)»
هرکس افسارخودرا به آرزویش بسپارد بوسیله اجل از پای در آید! «امام علی (ع)»
خشم را چون شربتی گوارا بنوش که من در مدت عمر شربتی به این شیرینی از گلو فرو نبرده‌ام! «امام علی (ع)»
خردمند به کار خویش تکیه کند و نادان به آرزوی خویش. «امام علی (ع)»
پرهیز باد تو را از غضب که آغازش سفاهت و انجامش ندامت است! «امام علی (ع)»
بلندی همت آن است که از هر چه در دست مردم است, نظر برگیری. «امام علی (ع)»
بکوش برای دنیای خود, به قدری که گویی همیشه زنده خواهی ماند و بکوش برای آخرت خود, به طوری که گویی فردا خواهی مرد. «امام علی (ع)»
بسی بینا که به چاه افتد و نابینا به راه افتد! «امام علی (ع)»
فراوانی گفتار بیهوده, نشانه قطعی از ضعف شخصیت گوینده‌است. «امام علی (ع)»
عجب دارم از کسی که سیم و زر می‌دهد و بنده می‌خرد, ولی با حسن اخلاق و نیکوکاری, مردان آزاد را مطیع و گرویده خود نمی‌سازد. «امام علی (ع)»
شرافت به خرد و ادب است نه به ثروت و مال. «امام علی (ع)»
اگر دستم را در دهان اژدها فرو برم, خوشتر دارم از این که از ناکسی که به مقامی رسیده است, چیزی بخواهم! «امام علی (ع)»
اگر خواهی از برادری ببری, راهی برای برگشتن باز گذار! شاید لازم شود! «امام علی (ع)»
زبان درنده‌ای است که اگر رها کنی, گوینده و شنونده را بدرد!! «امام علی (ع)»
راضی هستم که مرا با زنجیر اهنین سخت ببندید. در میان کوه و دشت, بر سنگ و خاشاک بکشانند. ولی هرگز رضا نیستم که دلی, از کردار من آزرده و خاطری, پریشان گردد! «امام علی (ع)»
شکم‌های خود را مقبره حیوانات مسازید! «امام علی (ع)»
در هر اجتماعی بیشتر قسم خورده شود, آن اجتماع خرابتر و مردمش دروغگوترند. «امام علی (ع)»
آنکه انتقام می‌گیرد یک روز خوشحال است و ان که می‌بخشد یک عمر! «امام علی (ع)»
دانشمند, در شمار زندگان است اگر چه مرده باشد و نادان, در شمار مردگان است اگر چه زنده باشد. «امام علی (ع)»
با هوی و هوس خود بجنگید همانطوریکه با دشمن خود می‌جنگید. «امام علی (ع)»
ناتوان‌ترین مردم کسی است که از اصلاح خود ناتوان باشد. «امام علی (ع)»
برتری مردم به یکدیگر به دانشها و خردهاست نه به ثروتها و تبارها. «امام علی (ع)»
اول خشم دیوانگی و آخرش پشیمانی است!! «امام علی (ع)»
گناهی که تو را پشیمان کند در نزد خداوند از کار خوبی که تو را به غرور وا دارد محبوبتر است! «امام علی (ع)» 
این شیطان است که راه‌هایش را هموار میکند تا قدم بر جای قدمهایش نهید و راهش را پی گیرید. «امام علی (ع)»
گناهی که تو را پشیمان کند بهتر از کار نیکی است که تو را به خودپسندی وادارد. «امام علی (ع)»
سخاوت آن است که تو آغاز کنی.زیرا آن چه با درخواست داده شود یا از روی شرم و یا از بیم شنیدن سخن ناپسند است. «امام علی (ع)»
اگر روح انسان چون آیینه از زنگ غم پاک باشد چه اهمیت دارد اگر چهره او پرچین باشد؟! «امام علی (ع)»
هر که پیش خود افتاده نباشد نزد دیگران بلند نیست. «امام علی (ع)»
طمعکار از همه مردم فقیرتر است! «امام علی (ع)»
چه بسا یک ساعت لذت مایه اندوه و غصه در روزگار درازی شود!! «امام علی (ع)»
پر اجرترین عبادتها آن است که نهانی باشد. «امام علی (ع)»";

	
	$lyrics = explode("\n", $lyrics);


	return wptexturize( $lyrics[ mt_rand(0, count($lyrics) - 1) ] );
}


function persian_quotes() {
	$chosen = persian_quotes_get_lyric();
	echo "<p id='quotes'>$chosen</p>";
}


add_action('admin_footer', 'persian_quotes');


function quotes_css() {
	
	$x = ( is_rtl() ) ? 'left' : 'right';

	echo "
	<style type='text/css'>
	#quotes {
		position: absolute;
		top: 4.5em;
		margin: 0;
		padding: 0;
		$x: 215px;
		font-size: 11px;
	}
	</style>
	";
}

add_action('admin_head', 'quotes_css');

?>
